<a href="https://colab.research.google.com/github/tinhb92/relax_ml/blob/master/sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
! pip install -U pandasql

Collecting pandasql
  Downloading https://files.pythonhosted.org/packages/6b/c4/ee4096ffa2eeeca0c749b26f0371bd26aa5c8b611c43de99a4f86d3de0a7/pandasql-0.7.3.tar.gz
Requirement already satisfied, skipping upgrade: numpy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.16.5)
Requirement already satisfied, skipping upgrade: pandas in /usr/local/lib/python3.6/dist-packages (from pandasql) (0.24.2)
Requirement already satisfied, skipping upgrade: sqlalchemy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.3.8)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.5.0 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2.5.3)
Requirement already satisfied, skipping upgrade: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied, skipping upgrade: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.5.0->pandas->pandasql) (1.12.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-cp36-none-any.whl size=26820 sha256=8d59fad00d1fa451b236eeaf7abae7abf8209c9f5a0d1286a84b94fb0292e129
  Stored in directory: /root/.cache/pip/wheels/53/6c/18/b87a2e5fa8a82e9c026311de56210b8d1c01846e18a9607fc9
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [0]:
from pandasql import sqldf, load_meat, load_births

In [0]:
pysqldf = lambda q: sqldf(q, globals())

In [0]:
meat = load_meat()

In [7]:
meat.head()

        date   beef   veal  ...  broilers  other_chicken  turkey
0 1944-01-01  751.0   85.0  ...       NaN            NaN     NaN
1 1944-02-01  713.0   77.0  ...       NaN            NaN     NaN
2 1944-03-01  741.0   90.0  ...       NaN            NaN     NaN
3 1944-04-01  650.0   89.0  ...       NaN            NaN     NaN
4 1944-05-01  681.0  106.0  ...       NaN            NaN     NaN

[5 rows x 8 columns]

In [0]:
births = load_births()

In [9]:
births.head()

        date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

In [28]:
meat.shape

(827, 8)

In [0]:
meat.query('beef>751')

In [25]:
pysqldf("SELECT * FROM meat LIMIT 10").head()

                         date   beef   veal  ...  broilers  other_chicken turkey
0  1944-01-01 00:00:00.000000  751.0   85.0  ...      None           None   None
1  1944-02-01 00:00:00.000000  713.0   77.0  ...      None           None   None
2  1944-03-01 00:00:00.000000  741.0   90.0  ...      None           None   None
3  1944-04-01 00:00:00.000000  650.0   89.0  ...      None           None   None
4  1944-05-01 00:00:00.000000  681.0  106.0  ...      None           None   None

[5 rows x 8 columns]

In [26]:
pysqldf("SELECT beef FROM meat WHERE beef>751").head()

    beef
0  787.0
1  774.0
2  834.0
3  786.0
4  764.0

In [31]:
pysqldf("SELECT SUM(CASE When beef>751 Then 1 Else 0 End ) as sum_beef FROM meat;").head()

    sum_beef
0  1361964.2

In [0]:
pysqldf("SELECT SUM(CASE When beef>751 Then beef Else 0 End ) as sum_beef FROM meat;").head()

In [32]:
pysqldf("SELECT * FROM meat ORDER BY beef").head()

                         date   beef  veal  ...  broilers  other_chicken  turkey
0  1946-09-01 00:00:00.000000  366.0  98.0  ...       NaN            NaN     NaN
1  1946-06-01 00:00:00.000000  461.0  78.0  ...       NaN            NaN     NaN
2  1951-06-01 00:00:00.000000  591.0  78.0  ...       NaN            NaN     NaN
3  1946-05-01 00:00:00.000000  605.0  83.0  ...       NaN            NaN     NaN
4  1944-04-01 00:00:00.000000  650.0  89.0  ...       NaN            NaN     NaN

[5 rows x 8 columns]

In [0]:
q = """SELECT
        m.date, m.beef, b.births
     FROM
        meats m
     INNER JOIN
        births b
           ON m.date = b.date;"""

In [0]:
joined = pysqldf(q)

In [0]:
q = """select
           strftime('%Y', date) as year
           , SUM(beef) as beef_total
           FROM
              meat
           GROUP BY
              year;"""

In [19]:
pysqldf(q).head()

   year  beef_total
0  1944      8801.0
1  1945      9936.0
2  1946      9010.0
3  1947     10096.0
4  1948      8766.0